using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp12
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //Дефиниране и инициалицация на едномерните масивите за допълнителна информация на тестето с карти
            String[] B = { "каро", "купа", "пика", "спатия" };
            String[] F = { "A","2","3","4","5","6","7","8","9","10","J","Q","K"};
            //дефиниране на масива A, който съдържа основната информация на тестето с карти
            int[,] A = new int[52, 2];
            //Инициализация 
            for (int i = 0, br = 0; i < 49; i = i + 4, br++)
            {
                A[i, 0] = br; A[i, 1] = 0;
                A[i+1, 0] = br; A[i+1, 1] = 1;
                A[i+2, 0] = br; A[i+2, 1] = 2;
                A[i+3, 0] = br; A[i+3, 1] = 3;
            }
            //Дефиниране на помощен масив с индексите на редовете на първоначалния масив
            int[] D = new int[52];
            //Инициализация  
            for (int i=0; i<52; i++) {
                D[i] = i;
            }
            //Неявно дефиниране на функция за разбъркване на едномерения масив int[] D
            //Генериране на две случайни числа           
            Random randomCreator = new Random();//Обект от класа Random
            int rand1 = randomCreator.Next(0, 52);//Дефиниране на цяло число от класа Int32, като използваме
                                                  //функция от обекта от класа Random
            int rand2 = randomCreator.Next(0, 52);//Дефиниране на цяло число от класа Int32, като използваме
                                                  //функция от обекта от класа Random
            //Разбъркваме
            for (int i = 0; i < 52; i++)
            {
                rand1 = randomCreator.Next(0, 52);//Още веднъж генериме случайно цяло число
                //Върти, докато станат равни и генерира отново случайно число
                for (int j = 0; j < 20 && rand1 == rand2; j++)
                {
                    rand2 = randomCreator.Next(0, 52);//Още веднъж генериме случайно цяло число
                }
                //Ако, обаче, вече станат равни или са били такива още в самото начало, то извежда съобщение за грешка.
                if (rand1 == rand2)
                {
                    throw new Exception("Няма да може да генерира разбъркване на масива повече, тъй като се генерират еднакви случайни числа.");
                }
                //разместваме две случайно взети карти с помощта на трета променлива
                int card = D[rand1];
                D[rand1] = D[rand2];
                D[rand2] = card;
            }//затваряме външния For-цикъл
            //Дефиниране на нов масив int[,] C, в който се записват редовете на двумерния масив А(картите),но в нова последователност,
            //генерирана чрез масива int[] D
            int[,] C = new int[52, 2];
            //инициализация на масива
            for (int i = 0; i < 52; i++)
            {
                C[i, 0] = A[D[i], 0]; C[i, 1] = A[D[i], 1];
            }
            //извеждане на масива C, но във вид на карти, дефинирани с лице и цвят - масивите int[] F и int[] B
            for (int i=0; i<52; i++)
            {
                Console.WriteLine(F[C[i, 0]] + " " + B[C[i, 1]]);
            }
        }
    }
}
